{"class_name": "Sequential", "backend": "tensorflow", "config": {"layers": [{"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "pointwise_constraint": null, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depthwise_constraint": null, "name": "separable_conv2d_1", "bias_constraint": null, "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "dtype": "float32", "use_bias": true, "depth_multiplier": 1, "batch_input_shape": [null, 48, 48, 3], "activation": "linear", "bias_regularizer": null, "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_1"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "pointwise_constraint": null, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depthwise_constraint": null, "name": "separable_conv2d_2", "bias_constraint": null, "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "dtype": "float32", "use_bias": true, "depth_multiplier": 1, "activation": "linear", "bias_regularizer": null, "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_2"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "pointwise_constraint": null, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depthwise_constraint": null, "name": "separable_conv2d_3", "bias_constraint": null, "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "dtype": "float32", "use_bias": true, "depth_multiplier": 1, "activation": "linear", "bias_regularizer": null, "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_3"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "pointwise_constraint": null, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depthwise_constraint": null, "name": "separable_conv2d_4", "bias_constraint": null, "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "dtype": "float32", "use_bias": true, "depth_multiplier": 1, "activation": "linear", "bias_regularizer": null, "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_4"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "pointwise_constraint": null, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depthwise_constraint": null, "name": "separable_conv2d_5", "bias_constraint": null, "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "dtype": "float32", "use_bias": true, "depth_multiplier": 1, "activation": "linear", "bias_regularizer": null, "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_5"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "SeparableConv2D", "config": {"kernel_size": [3, 3], "dilation_rate": [1, 1], "filters": 128, "activity_regularizer": null, "pointwise_constraint": null, "data_format": "channels_last", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_regularizer": null, "depthwise_constraint": null, "name": "separable_conv2d_6", "bias_constraint": null, "strides": [1, 1], "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "depthwise_regularizer": null, "dtype": "float32", "use_bias": true, "depth_multiplier": 1, "activation": "linear", "bias_regularizer": null, "padding": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_6"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "dtype": "float32", "trainable": true, "name": "activation_7"}}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "trainable": true, "epsilon": 0.001, "dtype": "float32", "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"dtype": "float32", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "dense_2", "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "dtype": "float32", "trainable": true, "name": "activation_8"}}], "name": "sequential_1"}, "keras_version": "2.3.1"}